In [53]:
!pip install PyMySQL pandas

Requirement already satisfied: PyMySQL in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (1.1.1)
Requirement already satisfied: pandas in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (2.3.1)
Requirement already satisfied: numpy>=1.23.2 in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Users/finn/Desktop/data-analyst-training/.venv/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.0 -> 25.2
[notice] To update, run: pip install --upgrade pip

## Database Connection Setup

In [54]:
import pymysql.cursors
import pandas as pd

# Connect to MySQL database locally
connection = pymysql.connect(
    host='localhost',
    user='root',
    password='',
    database='Northwind',  # Specify the database directly
    cursorclass=pymysql.cursors.DictCursor
)

# Create a cursor
cursor = connection.cursor()

## Execute Query Helper Function

In [ ]:
def execute_query(query):
    """Execute SQL query and return results as DataFrame"""
    try:
        cursor.execute(query)
        results = cursor.fetchall()
        return pd.DataFrame(results)
    except Exception as e:
        print(f"Error executing query: {e}")
        return None

## View All Customers

In [56]:
## Execute your SQL query
result = execute_query("SELECT * FROM Customers")  # Replace 'Customers' with your desired table name
print(result)

    CustomerID                        CustomerName         ContactName  \
0            1                 Alfreds Futterkiste        Maria Anders
1            2  Ana Trujillo Emparedados y helados        Ana Trujillo
2            3             Antonio Moreno Taquería      Antonio Moreno
3            4                     Around the Horn        Thomas Hardy
4            5                  Berglunds snabbköp  Christina Berglund
..         ...                                 ...                 ...
86          87                      Wartian Herkku    Pirkko Koskitalo
87          88              Wellington Importadora       Paula Parente
88          89                White Clover Markets      Karl Jablonski
89          90                         Wilman Kala     Matti Karttunen
90          91                              Wolski             Zbyszek

                          Address         City PostalCode  Country
0                   Obere Str. 57       Berlin      12209  Germany
1   Avda. de la Constitución 2222  México D.F.       5021   Mexico
2                  Mataderos 2312  México D.F.       5023   Mexico
3                 120 Hanover Sq.       London    WA1 1DP       UK
4                  Berguvsvägen 8        Luleå   S-958 22   Sweden
..                            ...          ...        ...      ...
86                    Torikatu 38         Oulu      90110  Finland
87             Rua do Mercado, 12      Resende  08737-363   Brazil
88    305 - 14th Ave. S. Suite 3B      Seattle      98128      USA
89                  Keskuskatu 45     Helsinki      21240  Finland
90                ul. Filtrowa 68        Walla     01-012   Poland

[91 rows x 7 columns]

## Customer Names and Countries

In [57]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, Country FROM Customers;")

## Print result
print(result)

                          CustomerName  Country
0                  Alfreds Futterkiste  Germany
1   Ana Trujillo Emparedados y helados   Mexico
2              Antonio Moreno Taquería   Mexico
3                      Around the Horn       UK
4                   Berglunds snabbköp   Sweden
..                                 ...      ...
86                      Wartian Herkku  Finland
87              Wellington Importadora   Brazil
88                White Clover Markets      USA
89                         Wilman Kala  Finland
90                              Wolski   Poland

[91 rows x 2 columns]

## French Customers and Their Cities (Without Comments)

In [58]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, City FROM Customers WHERE Country = 'France';")
print(result)

                 CustomerName        City
0        Blondel père et fils  Strasbourg
1                   Bon app''   Marseille
2             Du monde entier      Nantes
3           Folies gourmandes       Lille
4         France restauration      Nantes
5       La corne d''abondance  Versailles
6           La maison d''Asie    Toulouse
7           Paris spécialités       Paris
8        Spécialités du monde       Paris
9        Victuailles en stock        Lyon
10  Vins et alcools Chevalier       Reims

## Most Expensive Products

In [59]:
## Execute the SQL query
result = execute_query("SELECT ProductName, Price FROM Products WHERE Price > 50;")
print(result)

               ProductName Price
0          Mishi Kobe Niku    97
1         Carnarvon Tigers    63
2   Sir Rodney's Marmalade    81
3  Thüringer Rostbratwurst   124
4            Côte de Blaye   264
5    Manjimup Dried Apples    53
6     Raclette Courdavault    55

## Pattern Matching with LIKE

In [60]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, City, Country FROM Customers WHERE CustomerName LIKE 'B%';")
print(result)

                CustomerName        City  Country
0         Berglunds snabbköp       Luleå   Sweden
1    Blauer See Delikatessen    Mannheim  Germany
2       Blondel père et fils  Strasbourg   France
3  Bólido Comidas preparadas      Madrid    Spain
4                  Bon app''   Marseille   France
5     Bottom-Dollar Marketse   Tsawassen   Canada
6             B''s Beverages      London       UK

## Customers Sorted Alphabetically (Ascending)

In [61]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, Country FROM Customers ORDER BY CustomerName ASC;")
print(result)

                          CustomerName  Country
0                  Alfreds Futterkiste  Germany
1   Ana Trujillo Emparedados y helados   Mexico
2              Antonio Moreno Taquería   Mexico
3                      Around the Horn       UK
4                       B''s Beverages       UK
..                                 ...      ...
86                      Wartian Herkku  Finland
87              Wellington Importadora   Brazil
88                White Clover Markets      USA
89                         Wilman Kala  Finland
90                              Wolski   Poland

[91 rows x 2 columns]

## Customers Sorted Alphabetically (Descending)

In [62]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, Country FROM Customers ORDER BY CustomerName DESC;")
print(result)

                          CustomerName  Country
0                               Wolski   Poland
1                          Wilman Kala  Finland
2                 White Clover Markets      USA
3               Wellington Importadora   Brazil
4                       Wartian Herkku  Finland
..                                 ...      ...
86                      B''s Beverages       UK
87                     Around the Horn       UK
88             Antonio Moreno Taquería   Mexico
89  Ana Trujillo Emparedados y helados   Mexico
90                 Alfreds Futterkiste  Germany

[91 rows x 2 columns]

## Top 5 Most Expensive Products

In [63]:
## Execute the SQL query
result = execute_query("SELECT ProductName, Price FROM Products ORDER BY Price DESC LIMIT 5;")
print(result)

               ProductName Price
0            Côte de Blaye   264
1  Thüringer Rostbratwurst   124
2          Mishi Kobe Niku    97
3   Sir Rodney's Marmalade    81
4         Carnarvon Tigers    63

## 10 Most Recent Orders

In [64]:
## Execute the SQL query
result = execute_query("SELECT OrderID, OrderDate, CustomerID FROM Orders ORDER BY OrderDate DESC LIMIT 10;")
print(result)

   OrderID  OrderDate  CustomerID
0    10443 1997-02-12          66
1    10442 1997-02-11          20
2    10440 1997-02-10          71
3    10441 1997-02-10          55
4    10439 1997-02-07          51
5    10438 1997-02-06          79
6    10436 1997-02-05           7
7    10437 1997-02-05          87
8    10435 1997-02-04          16
9    10434 1997-02-03          24

## Top 3 French Customers by Name

In [65]:
## Execute the SQL query
result = execute_query("SELECT CustomerName, ContactName, City FROM Customers WHERE Country = 'France' ORDER BY CustomerName ASC LIMIT 3;")
print(result)

           CustomerName         ContactName        City
0  Blondel père et fils  Frédérique Citeaux  Strasbourg
1             Bon app''   Laurence Lebihans   Marseille
2       Du monde entier      Janine Labrune      Nantes

## 5 Cheapest Products Under £20

In [66]:
## Execute the SQL query
result = execute_query("SELECT ProductName, Price, Unit FROM Products WHERE Price < 20 ORDER BY Price ASC LIMIT 5;")
print(result)

          ProductName Price              Unit
0             Geitost     3             500 g
1  Guaraná Fantástica     5  12 - 355 ml cans
2               Konbu     6          2 kg box
3            Filo Mix     7   16 - 2 kg boxes
4           Tourtière     7           16 pies

## 10 Cheapest Products Under £20

In [67]:
## Execute the SQL query
result = execute_query("SELECT ProductName, Price, Unit FROM Products WHERE Price < 20 ORDER BY Price ASC LIMIT 10;")
print(result)

                       ProductName Price                  Unit
0                          Geitost     3                 500 g
1               Guaraná Fantástica     5      12 - 355 ml cans
2                            Konbu     6              2 kg box
3                        Tourtière     7               16 pies
4                         Filo Mix     7       16 - 2 kg boxes
5             Rhönbräu Klosterbier     8    24 - 0.5 l bottles
6       Teatime Chocolate Biscuits     9  10 boxes x 12 pieces
7                         Tunnbröd     9      12 - 250 g pkgs.
8                    Aniseed Syrup    10   12 - 550 ml bottles
9  Jack's New England Clam Chowder    10       12 - 12 oz cans